projects/tc-finder/index.html
<!-- Generated from b153a2d on 2023-11-27 @ 11:06 with Emacs 27.1 (Org mode 9.3) -->
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta author="J. Dylan White"/><meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/code.css"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/site.css"/><title>Tropical Cyclone Classifier - J. Dylan White</title></head><body><header class="site-header"><div class="container"><div class="site-title"><a class="site-name" href="/">J. Dylan White</a> </div></div><div class="site-masthead"><div class="container"><nav class="nav"><a class="nav-link" href="/">Home</a> <a class="nav-link" href="/projects/">Projects</a> <a class="nav-link" href="/dotfiles/">Dotfiles</a> </nav></div></div></header><div class="container"><div class="site-post"><h1 class="site-post-title">Tropical Cyclone Classifier</h1><p class="site-post-meta"></p><div id="content"><p>
When I went through several courses on machine learning, I was always provided with neatly packaged datasets to learn and train models with, but that&rsquo;s not usually how it works in real life. Starting with a binary image classification model, I wanted to build my own computer vision models centered around finding tropical cyclones from satellite imagery. Over time, I&rsquo;d like to make this more sophisticated, but there are several steps involved in getting even a simple binary image classifier established, at least with the workflow I have established.
</p>

<h2><a id="exploratory-data-analysis" class="anchor" href="#exploratory-data-analysis">¶</a>Exploratory Data Analysis</h2><div class="outline-text-2" id="text-org3dc4c86">
<ul class="org-ul">
<li><a href="ibtracs.html">Exploring the IBTrACS storm track data</a> - investigating a human-derived dataset showing time, location, and other meteorological variables for tropical storms.</li>
</ul>
</div>
</div></div></div><footer class="site-footer"><div class="container"><div class="row"><div class="column"><p><a href="https://github.com/jdylanwhite">GitHub</a> · <a href="https://www.linkedin.com/in/jdylanwhite5">LinkedIn</a> · <a href="mailto:jdylanwhite5@gmail.com">Email</a></p></div><div class="column align-right"><p><a href="https://github.com/jdylanwhite/jdylanwhite.github.io">Site Source</a></p></div></div></div></footer></body></html>
